app/Controllers/Api/UserController.php

    public function login()
    {
        $rules = [
            "user_email" => "required|valid_email|min_length[5]",
            "user_password" => "required",
        ];

        $messages = [
            "user_email" => [
                "required" => "Email required",
                "valid_email" => "Email address is not in format"
            ],
            "user_password" => [
                "required" => "password is required"
            ],
        ];

        if (!$this->validate($rules, $messages)) {

            $response = [
                'status' => 500,
                'error' => true,
                'message' => $this->validator->getErrors(),
                'data' => []
            ];

        } else {
            $userModel = new UserModel();

            $userdata = $userModel->where("user_email", $this->request->getVar("user_email"))->first();
---
SELECT *
FROM `users`
WHERE `user_email` = 'juan25@hotmail.com'
 LIMIT 1

    public function changeRole()
    {
        $rules = [
            "id_user" => "required",
            "user_role" => "required",
        ];

        $messages = [
            "id_user" => [
                "required" => " user id is required",

            ],

            "user_role" => [
                "required" => "user Role is required"
            ],
        ];

        if (!$this->validate($rules, $messages)) {

            $response = [
                'status' => 500,
                'error' => true,
                'message' => $this->validator->getErrors(),
                'data' => []
            ];

        } else {
            $userModel = new UserModel();

            $userdata = $userModel->where("id_user", $this->request->getVar("id_user"))->first();
---
SELECT *
FROM `users`
WHERE `id_user` = '21'
 LIMIT 1

// second , if the result of the research is not empty

                $data['user_role'] =$this->request->getVar("user_role");
                $userModel->update($userdata['id_user'], $data);
---
UPDATE `users` SET `user_role` = 'operator'
WHERE `users`.`id_user` IN ('21')